''' Задача 2: Найдите сумму цифр трехзначного числа.

*Пример:*

123 -> 6 (1 + 2 + 3)
100 -> 1 (1 + 0 + 0)
 '''

number = int(input("Введите трехзначное чило: "))

a = number // 100
b = (number % 100) // 10
c = number % 10

if number < 1000 and number > 99 :
    sum = a + b + c
else:
    print("Введено не трёхзначное число. Повторите ввод")

print(sum)